Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Sometimes your OpenId Connect provider supports a metadata discovery but does not return all the endpoint URLs required for the authorization code flow to complete or for the application to support the additional functions such as a user logout. In such cases you can simply configure a missing endpoint URL locally:
ja_jp: OpenId Connect プロバイダがメタデータの検出をサポートしていても、 認可コードフローを完了させたりアプリケーションがログアウトなどの追加機能をサポートしたりするのに必要なエンドポイント URL をすべて返さないことがあります。そのような場合は、不足するエンドポイントURLをローカルに設定するだけです。

source: Sometimes, ID tokens are forwarded to application frontends as bearer tokens. This helps endpoints identify the user logged into SPA or perform out-of-band token verification. Choose the *With ID Token* option in such cases.
ja_jp: 場合によっては、ID トークンがベアラートークンとしてアプリケーションフロントエンドに転送されることがあります。 これにより、エンドポイントが SPA にログインしているユーザーを識別したり、帯域外のトークン検証を実行したりできるようになります。 このような場合は、*With ID Token* オプションを選択してください。

source: Sometimes, `SecurityIdentity` for a given token must be created when there is no active HTTP request context. The `quarkus-oidc` extension provides `io.quarkus.oidc.TenantIdentityProvider` to convert a token to a `SecurityIdentity` instance. For example, one situation when you must verify the token after the HTTP request has completed is when you are processing messages with xref:vertx.adoc#event-bus[Vert.x event bus]. The example below uses the 'product-order' message within different CDI request contexts. Therefore, an injected `SecurityIdentity` would not correctly represent the verified identity and be anonymous.
ja_jp: 場合によっては、アクティブな HTTP リクエストコンテキストが存在しない場合に、特定のトークンの `SecurityIdentity` を作成する必要があります。 `quarkus-oidc` エクステンションは、トークンを `SecurityIdentity` インスタンスに変換するための `io.quarkus.oidc.TenantIdentityProvider` を提供します。 たとえば、HTTP リクエストが完了した後にトークンを検証する必要がある状況の 1 つとして、xref:vertx.adoc#event-bus[Vert.x イベントバス] を使用してメッセージを処理する場合があります。 以下の例では、さまざまな CDI リクエストコンテキスト内で 'product-order' メッセージを使用しています。 したがって、注入された `SecurityIdentity` は、検証されたアイデンティティーを正しく表さず、匿名になります。

source: Sometimes, additional HTTP headers must also be provided to complete the authorization code flow. Use the `quarkus.oidc.code-grant.headers` map property in such cases.
ja_jp: 認可コードフローを完了するために、追加の HTTP ヘッダーを提供しなければならない場合があります。そのような場合は、 `quarkus.oidc.code-grant.headers` マップ設定プロパティーを使用してください。

source: Sometimes, it's helpful not to execute Flyway initialization on each application startup. One such example is when deploying
ja_jp: アプリケーションの起動ごとにFlywayの初期化を実行しない方が便利な場合があります。そのような例の一つがデプロイ時です。

source: Sometimes, it's helpful not to execute Flyway initialization on each application startup. One such example is when deploying on Kubernetes, where it doesn't make sense to execute Flyway on every single replica. Instead it's desirable to execute it once and then start the actual application without Flyway. To support this use case, when generating manifests for Kubernetes the generated manifests contain a Kubernetes initialization `Job` for Flyway. The `Job` performs initialization and the actual `Pod`, will starts once the `Job` is successfully completed.
ja_jp: アプリケーションの起動時に毎回Flywayの初期化を実行しない方が便利な場合があります。そのような例として、Kubernetes上にデプロイする場合、すべてのレプリカでFlywayを実行するのは理にかなっていません。その代わりに、一度実行してから、Flywayを使わずに実際のアプリケーションを起動することが望ましいです。このユースケースをサポートするために、Kubernetes用のマニフェストを生成する際に、生成されたマニフェストにはFlyway用のKubernetes初期化 `Job` が含まれています。 `Job` は初期化を行い、 `Job` が正常に終了すると、実際の `Pod` が開始されます。

source: Sometimes, it's helpful not to execute Liquibase initialization on each application startup. One such example is when deploying on Kubernetes, where it doesn't make sense to execute Liquibase on every single replica. Instead it's desirable to execute it once and then start the actual application without Liquibase. To support this use case, when generating manifests for Kubernetes the generated manifests contain a Kubernetes initialization `Job` for Liquibase. The `Job` performs initialization and the actual `Pod`, will starts once the `Job` is successfully completed.
ja_jp: 時には、アプリケーションの起動毎に Liquibase の初期化を実行しない方が良い場合もあります。そのような例として、Kubernetes でデプロイするとき、すべてのレプリカで Liquibase を実行することは意味がありません。その代わりに、一度実行し、その後 Liquibase なしで実際のアプリケーションを開始することが望ましいです。このユースケースをサポートするために、Kubernetesのためのマニフェストを生成するとき、生成されたマニフェストはLiquibaseのためのKubernetes初期化 `Job` を含んでいます。 `Job` は初期化を行い、 `Job` が正常に完了すると、実際の `Pod` が開始されます。

source: Sometimes, one may have to acquire tokens in a blocking manner before propagating them with the REST client. This example shows how to acquire the tokens in such cases.
ja_jp: 場合によっては、REST クライアントでトークンを伝播する前に、ブロック方式でトークンを取得する必要があります。この例では、そのような場合にトークンを取得する方法を示します。

source: Sometimes, only authenticating users with a social provider is not enough. A provider-specific service also needs to be accessed for the Quarkus OIDC `web-app` application to fetch or update data from the provider service on behalf of the currently authenticated user.
ja_jp: 場合によっては、ソーシャルプロバイダーを使用してユーザーを認証するだけでは不十分なことがあります。 現在認証されているユーザーに代わってプロバイダーサービスからデータを取得または更新するには、Quarkus OIDC `web-app` アプリケーションでプロバイダー固有のサービスにアクセスする必要があります。

source: Sometimes, the database connection pool cannot be configured only by declaration.
ja_jp: データベース接続プールは、宣言だけでは設定できないことがあります。

source: Sometimes, the previously described rules allow multiple permission sets to win simultaneously. In that case, for the request to proceed, all the permissions must allow access. For this to happen, both must either have specified the method or have no method. Method-specific matches take precedence.
ja_jp: 場合によっては、前述のルールにより、複数の権限セットが同時に適用されることがあります。 その場合、リクエストを続行するには、すべての権限でアクセスが許可されている必要があります。 そのためには、両方にメソッドが指定されているか、メソッドが存在しない必要があります。 メソッド固有のマッチが優先されます。

source: Sometimes, though, you might have a few related functions that share code and creating multiple maven modules is just an overhead you don't want to do. The extension allows you to bundle multiple functions in one project and use configuration or an environment variable to pick the function you want to deploy.
ja_jp: しかし、同じコードを利用するCloud Functionの関数クラスが複数あるような場合に、個別maven モジュールを作成することは手間となります。このQuarkusエクステンションを使うと、複数のCloud Function関数を一つのプロジェクトにバンドルし、設定や環境変数を使ってデプロイしたい関数を選択することができます。

source: Sometimes, though, you might have a few related lambdas that share code and creating multiple maven modules is just an overhead you don't want to do. The `quarkus-amazon-lambda` extension allows you to bundle multiple lambdas in one project and use configuration or an environment variable to pick the handler you want to deploy.
ja_jp: しかし、時にはコードを共有するいくつかの関連する Lambda があって、複数の maven モジュールを作成することは、やりたくないオーバーヘッドに過ぎないことがあるかもしれません。 `quarkus-amazon-lambda` エクステンションを使用すると、1 つのプロジェクトに複数のラムダをバンドルし、設定または環境変数を使用してデプロイしたいハンドラーを選択することができます。

source: Sometimes, you may want to revoke the current authorization code flow access and/or refresh tokens. You can revoke tokens with `quarkus.oidc.OidcProviderClient` which provides access to the OIDC provider's UserInfo, token introspection and revocation endpoints.
ja_jp: 場合によっては、現在の認可コードフローアクセストークンやリフレッシュトークンを取り消す必要があることもあります。 その場合は、OIDC プロバイダーの UserInfo、トークンイントロスペクション、失効エンドポイントへのアクセスが提供される `quarkus.oidc.OidcProviderClient` を使用してトークンを取り消すことができます。

source: Sometimes, you might need to configure the behavior of the `ValidatorFactory`, for instance to use a specific `ParameterNameProvider`.
ja_jp: 時には、 `ValidatorFactory` の動作を設定する必要があるかもしれません。例えば、特定の `ParameterNameProvider` を使用するためなどです。

source: Sometimes, you might want to revoke the current authorization code flow access tokens, refresh tokens, or both. You can revoke tokens with `quarkus.oidc.OidcProviderClient`, which provides access to the OIDC provider's UserInfo, token introspection, and revocation endpoints.
ja_jp: 場合によっては、現在の認可コードフローアクセストークン、リフレッシュトークン、またはその両方を取り消す必要があることもあります。 トークンは `quarkus.oidc.OidcProviderClient` を使用して取り消すことができます。これは OIDC プロバイダーの UserInfo、トークンイントロスペクション、および失効エンドポイントへのアクセスを提供します。

source: Sometimes, you need to have an imperative way of sending messages.
ja_jp: 時には、命令的な方法でメッセージを送ることが必要になる場合もあります。

source: Sometimes, you will want to ask for more data than just a username in order to register a user, or you want to deal with login and registration with custom validation, and so the WebAuthn callback endpoint is not enough.
ja_jp: 時には、ユーザーを登録するためにユーザー名以外のデータを要求したり、カスタムバリデーションでログインや登録を処理したいので、WebAuthnコールバックエンドポイントでは十分でないことがあります。

source: Sometimes, you will want to ask for more data than just a username in order to register a user, or you want to deal with login and registration with custom validation, and so the default WebAuthn login and registration endpoints are not enough.
ja_jp: ユーザーを登録するために、ユーザー名だけでなく、追加のデータを要求したり、カスタムバリデーションでログインや登録を 処理したりする必要がある場合があります。そのため、デフォルトの WebAuthn ログインおよび登録エンドポイントでは 十分でないことがあります。

source: Sometimes, you're not in control of the classes that you want to use in your template, and you cannot add methods to them. Template extension methods allow you to declare new methods for those classes that will be available from your templates just as if they belonged to the target class.
ja_jp: 場合によっては、テンプレートで使用するクラスを制御できず、そのクラスにメソッドを追加できないことがあります。テンプレート拡張メソッドを使用すると、テンプレートから利用できるようになるクラスの新しいメソッドを、あたかもターゲットクラスに属しているかのように宣言できます。

source: Sometimes, you're not in control of the classes that you want to use in your template, and you cannot add methods to them. Template extension methods allows you to declare new method for those classes that will be available from your templates just as if they belonged to the target class.
ja_jp: 時には、テンプレートで使用したいクラスをコントロールできず、それらのクラスにメソッドを追加できないことがあります。テンプレート拡張メソッドを使うと、テンプレートから利用できるようになるクラスのメソッドを、あたかもターゲットクラスに属しているかのように宣言することができます。

source: Sorting
ja_jp: ソート

source: Sorting beans obtained with programmatic lookup
ja_jp: プログラムによる検索で取得した Bean のソート

source: Sorts the entities that are returned by the list operation
ja_jp: list操作で返されたエンティティをソートします

source: Source
ja_jp: ソース

source: Source class
ja_jp: ソースクラス

source: Source file
ja_jp: ソースファイル

source: Source line
ja_jp: ソースライン

source: Source location
ja_jp: ソースの場所

source: Source locations
ja_jp: ソースの場所

source: Source method
ja_jp: ソース・メソッド

source: Source of roles
ja_jp: ロールのソース

source: Source set configuration example
ja_jp: ソースセットの設定例

source: Sources
ja_jp: ソース

source: Sources for third party jar dependencies, including Quarkus source code, are not added to the source cache by default. To include those, make sure you invoke `mvn dependency:sources` first. This step is required in order to pull the sources for these dependencies, and get them included in the source cache.
ja_jp: Quarkusのソースコードを含むサードパーティのjar依存関係のソースは、デフォルトではソースキャッシュに追加されません。これらを含めるには、まず `mvn dependency:sources` を起動してください。このステップは、これらの依存関係のソースを引き出し、ソースキャッシュに含めるために必要です。

source: Speaking of generated classes. The bean discovery, validation and wiring all components together - all this is perfomed at build time. Quarkus then stores the collected metadata in the bytecode, i.e. for each bean one or more classes are generated. In order to fullfill some basic CDI API requirements, a bean has at least a corresponding `javax.enterprise.inject.spi.Bean` implementation. If it's a normal scoped bean then a client proxy class must be also generated. Finally, intercepted and decorated beans require some more internal constructs.
ja_jp: 生成されたクラスについて。Beanの検出、検証、すべてのコンポーネントのワイヤリングは、すべてビルド時に実行されます。Quarkusでは、収集したメタデータをバイトコードに格納し、各Beanに対して1つ以上のクラスを生成します。いくつかの基本的なCDI API要件を満たすために、Beanは少なくとも対応する `javax.enterprise.inject.spi.Bean` の実装を持っています。それが通常のスコープ付きBeanである場合，クライアントプロキシクラスも生成されなければなりません。最後に，インターセプトされたBean及び装飾されたBeanは，さらにいくつかの内部構造を必要とします。

source: Speaking of, make sure to not drop your database schema in production! Add the following in your properties file.
ja_jp: ところで、実稼働環境でデータベーススキーマを削除しないようにしてください。 プロパティーファイルに以下を追加してください。

source: Special level for all messages including custom levels.
ja_jp: カスタムレベルを含むすべてのメッセージのための特別なレベル

source: Special level to turn off logging.
ja_jp: ロギングをオフにするための特別なレベル

source: Specialization is not supported
ja_jp: 専門性はサポートされていません。

source: Specific automatic Micrometer metrics are all disabled by default and can be enabled by setting, for example in the case of JVM metrics:
ja_jp: 特定の自動 Micrometer メトリクスはすべてデフォルトで無効になっていますが、設定によって有効にできます。たとえば、JVM メトリクスの場合:

source: Specific topics
ja_jp: 具体的なトピック

source: Specifically for type-safe GraphQL clients, you can override this on a per-client basis by annotating the `GraphQLClientApi` interface with `@io.quarkus.oidc.client.filter.OidcClientFilter`. For example:
ja_jp: 以下のように、特に型安全な GraphQL クライアントの場合、 `GraphQLClientApi` インターフェイスに `@io.quarkus.oidc.client.filter.OidcClientFilter` のアノテーションを付けることで、これをクライアントごとにオーバーライドできます。

source: Specifically for type-safe GraphQL clients, you can override this on a per-client basis by annotating the `GraphQLClientApi` interface with `@io.quarkus.oidc.client.filter.OidcClientFilter`.
ja_jp: 特に型安全な GraphQL クライアントの場合、 `GraphQLClientApi` インターフェイスに `@io.quarkus.oidc.client.filter.OidcClientFilter` アノテーションを付けることで、クライアントごとにこれをオーバーライドできます。

source: Specifically you should run the link:https://redhat-developer-demos.github.io/knative-tutorial/knative-tutorial/eventing/eventing-trigger-broker.html[Brokers and Triggers] tutorial as this guide requires that you can invoke on a Broker to trigger the quickstart code.
ja_jp: このガイドでは、クイックスタートコードをトリガーするためにブローカーを呼び出す必要があるため、特に link:https://redhat-developer-demos.github.io/knative-tutorial/knative-tutorial-eventing/eventing-trigger-broker.html[ブローカーとトリガー] のチュートリアルを実行する必要があります。

source: Specifically, Quarkus implements the link:https://github.com/k8s-service-bindings/spec#workload-projection[Workload Projection] part of the specification, therefore allowing applications to bind to services, such as a Database or a Broker, without the need for user configuration.
ja_jp: 具体的には、Quarkus は、仕様の link:https://github.com/k8s-service-bindings/spec#workload-projection[Workload Projection] の部分を実装しているため、アプリケーションから Database または Broker などのサービスに、ユーザー設定なしでバインドすることができます。

source: Specifically, Quarkus implements the link:https://github.com/servicebinding/spec#workload-projection[Workload Projection] part of the specification, therefore allowing applications to bind to services, such as a Database or a Broker, without the need for user configuration.
ja_jp: 具体的には、Quarkus は、仕様の link:https://github.com/servicebinding/spec#workload-projection[Workload Projection] の部分を実装しているため、アプリケーションから Database または Broker などのサービスに、ユーザー設定なしでバインドすることができます。

source: Specifically, this class is the input of the problem:
ja_jp: 具体的には、このクラスは問題の入力です。

source: Specifically: class-level interceptor bindings declared on the bindings source class are treated as class-level bindings of the intercepted class. Method-level interceptor bindings declared on the bindings source class are treated as method-level bindings of a method with the same name, return type, parameter types and `static` flag of the intercepted class.
ja_jp: 具体的には、バインディングソースクラスで宣言されたクラスレベルのインターセプターバインディングは、インターセプトされたクラスのクラスレベルのバインディングとして扱われます。 バインディングソースクラスで宣言されたメソッドレベルのインターセプターバインディングは、インターセプトされたクラスと同じ名前、戻り値の型、パラメーターの型、および `static` フラグを持つメソッドのメソッドレベルのバインディングとして扱われます。

source: Specifically: if the only qualifier a bean has is `@Named`, it also automatically gets `@Default`. This means that if multiple beans of the same type exist, one of them without qualifiers and the others with `@Named`, they _all_ get the `@Default` qualifier and bean resolution will error with ambiguity. For example:
ja_jp: 具体的には、Bean が持つ修飾子が `@Named` のみの場合、自動的に `@Default` も取得します。これは、同じ型の複数の Bean が存在し、1 つが修飾子なし、残りが `@Named` の場合、_すべて_ が `@Default` 修飾子を取得し、Bean の解決があいまいさでエラーになることを意味します。例を次に示します。

source: Specification-defined config property
ja_jp: 仕様定義の設定プロパティー

source: Specified the name of the datasource as follows:
ja_jp: データソースの名前を以下のように指定しました。

source: Specifies allowed origins, including a regular expression.
ja_jp: 正規表現など、使用可能なオリジンを指定します。

source: Specifies allowed origins, including a regular expression. When not specified, CORS is not permitted, and only same-origin requests are allowed.
ja_jp: 正規表現を含む、許可されるオリジンを指定します。指定しない場合は CORS は許可されず、同一オリジンのリクエストのみが許可されます。

source: Specifies named `io.quarkus.vertx.http.runtime.security.HttpSecurityPolicy` that should authorize access to the specified Jakarta REST endpoints. Named HttpSecurityPolicy can be used for general authorization checks as demonstrated by <<authorization-policy-example>>.
ja_jp: 指定された Jakarta REST エンドポイントへのアクセスを許可する名前付き `io.quarkus.vertx.http.runtime.security.HttpSecurityPolicy` を指定します。 <<authorization-policy-example>> で例示されているように、名前付き HttpSecurityPolicy は、一般的な認可チェックに使用できます。

source: Specifies that all security roles are allowed to invoke the specified methods. `@PermitAll` lets everybody in even without authentication.
ja_jp: すべてのセキュリティロールが指定されたメソッドを呼び出すことを許可されているように指定します。 `@PermitAll` は未認証含め誰でも許可します。

source: Specifies that all security roles are allowed to invoke the specified methods. `@PermitAll` lets everybody in, even without authentication.
ja_jp: すべてのセキュリティロールが指定されたメソッドを呼び出すことを許可されるように指定します。 `@PermitAll` は認証なしでも誰でもアクセスできるようにします。

source: Specifies that no security roles are allowed to invoke the specified methods.
ja_jp: どのセキュリティロールも指定されたメソッドを呼び出すことを許可されていないことを指定します。

source: Specifies the URL of the Keycloak server and the realm used for authentication.
ja_jp: Keycloak サーバーの URL と認証に使用するレルムを指定します。

source: Specifies the `upn` (User Principal Name) claim, which the {mp-jwt} specification defines as the preferred claim for identifying the `Principal` in container security APIs.
ja_jp: `upn` (ユーザープリンシパル名) クレームを指定します。{mp-jwt} 仕様では、コンテナーセキュリティー API で `Principal` を識別するための推奨クレームとして定義されています。

source: Specifies the fetch size to be used when loading primary keys if objects to be indexed.
ja_jp: プライマリーキーをロードする際に使用するフェッチサイズの指定 (インデックスを作成するオブジェクトの場合)。

source: Specifies the list of permissions that are allowed to invoke the specified methods.
ja_jp: 指定されたメソッドを呼び出すことが許可される権限のリストを指定します。

source: Specifies the list of security roles allowed to access methods in an application.
ja_jp: アプリケーション内のメソッドへのアクセスを許可するセキュリティーロールのリストを指定します。

source: Specifies the list of security roles allowed to access methods in an application. As an equivalent to `@RolesAllowed("**")`, {project-name} also provides the `io.quarkus.security.Authenticated` annotation that permits any authenticated user to access the resource.
ja_jp: アプリケーション内のメソッドへのアクセスが許可されているセキュリティロールのリストを指定します。 `@RolesAllowed("**")` に相当するものとして、{project-name} は、認証されたユーザーがリソースにアクセスできるようにする `io.quarkus.security.Authenticated` アノテーションも提供します。

source: Specifies the list of security roles permitted to access methods in an application. As an equivalent to `@RolesAllowed("**")`, {project-name} also provides the `io.quarkus.security.Authenticated` annotation that permits any authenticated user to access the resource.
ja_jp: アプリケーション内のメソッドへのアクセスが許可されているセキュリティロールのリストを指定します。 `@RolesAllowed("**")` に相当するものとして、{project-name} は、認証されたユーザーがリソースにアクセスできるようにする `io.quarkus.security.Authenticated` アノテーションも提供します。

source: Specifies the location of the public key file `publicKey.pem` on the classpath. See <<add-public-key>> for adding this key.
ja_jp: クラスパス上の公開鍵ファイル `publicKey.pem` の場所を指定します。 このキーの追加方法は <<add-public-key>> を参照してください。

source: Specifies the timeout of transactions for loading ids and entities to be re-indexed.
ja_jp: インデックスを再作成する ID とエンティティーをロードするためのトランザクションのタイムアウトの指定。

source: Specify a Platform Stream
ja_jp: プラットフォーム・ストリームの指定

source: Specify a specific Platform Release BOM
ja_jp: 特定のプラットフォーム・リリースBOMを指定

source: Specify a unique id for the section in lower-kebab-case.
ja_jp: 小文字のケバブケースでセクションの一意の ID を指定します。

source: Specify how security information is stored in the model by adding the following annotations to the `user` entity:
ja_jp: `user` エンティティーに以下のアノテーションを追加することで、セキュリティ情報がどのようにモデルに格納されるかを指定します：

source: Specify in connector
ja_jp: コネクターで指定

source: Specify the _load script_ you want to load using:
ja_jp: 使用する _ロードスクリプト_ を指定します:

source: Specify the `web` category, as our imaginary extension works with Http requests.
ja_jp: `web` カテゴリを指定します。この想像上のエクステンションは、Http リクエストで動作します。

source: Specify the class in your runtime or runtime‑dev module that contains the methods.
ja_jp: ランタイムモジュールまたは runtime-dev モジュール内の、メソッドを含むクラスを指定します。

source: Specify the codec to use for both the deserialization and serialization of the message
ja_jp: メッセージのデシリアライゼーションとシリアライゼーションの両方に使用するコーデックを指定します。

source: Specify the codec to use for the deserialization of the incoming message
ja_jp: 受信メッセージのデシリアライズに使用するコーデックを指定します

source: Specify the codec to use for the serialization of the outgoing message
ja_jp: 送信メッセージのシリアライゼーションに使用するコーデックを指定します。

source: Specify the commit strategy to apply when a message produced from a record is acknowledged. Values can be `ack`, `cumulative`.
ja_jp: レコードから生成されたメッセージが確認されたときに適用するコミット戦略を指定します。値は `ack` , `cumulative` です。

source: Specify the commit strategy to apply when a message produced from a record is acknowledged. Values can be `latest`, `ignore` or `throttled`. If `enable.auto.commit` is true then the default is `ignore` otherwise it is `throttled` Type: _string_
ja_jp: レコードから生成されたメッセージが確認されたときに適用するコミットストラテジーを指定します。値は、 `latest` 、 `ignore` 、 `throttled` のいずれかです。 `enable.auto.commit` がtrueであれば、デフォルトは `ignore` です。そうでなければ `throttled` です。 Type: _string_

source: Specify the container engine:
ja_jp: コンテナーエンジンを指定する:

source: Specify the diataxis type: `concept`, `howto`, `reference`, or `tutorial`.
ja_jp: `concept`、 `howto`、 `reference`、または `tutorial` から diataxis のタイプを指定します。

source: Specify the failure strategy to apply when a message produced from a record is acknowledged negatively (nack). Values can be `fail` (default), `ignore`, or `dead-letter-queue` Type: _string_
ja_jp: レコードから生成されたメッセージが否定的に確認された（nack）場合に適用する失敗戦略を指定します。値は、 `fail` （デフォルト）、 `ignore` 、または `dead-letter-queue` Type: _string_

source: Specify the failure strategy to apply when a message produced from a record is acknowledged negatively (nack). Values can be `nack` (default), `fail`, `ignore` or `reconsume-later
ja_jp: レコードから生成されたメッセージが否定応答(nack)されたときに適用する失敗ストラテジーを指定します。指定できる値は `nack` (デフォルト)、 `fail` 、 `ignore` あるいは `reconsume-later' です。

source: Specify the failure strategy to apply when a message produced from a record is acknowledged negatively (nack). Values can be `nack` (default), `fail`, `ignore` or `reconsume-later`
ja_jp: レコードから生成されたメッセージが否定応答 (nack) されたときに適用する失敗ストラテジーを指定します。指定できる値は `nack` (デフォルト)、 `fail`、 `ignore`、または `reconsume-later` です。

source: Specify the failure strategy to apply when a message produced from an AMQP message is nacked. Accepted values are `fail` (default), `accept`, `release`, `reject`, `modified-failed`, `modified-failed-undeliverable-here` Type: _string_
ja_jp: AMQP メッセージから生成されたメッセージがナックされたときに適用する失敗の戦略を指定します。指定できる値は `fail` (デフォルト)、 `accept`、 `release`、 `reject`、 `modified-failed`、 `modified-failed-undeliverable-here` です。 タイプ: _string_

source: Specify the full title of the section and use sentence case.
ja_jp: セクションの完全なタイトルを指定し、文頭に大文字を使用します。

source: Specify the relevant <<categories>> (comma separated).
ja_jp: 関連する<<categories>> (コンマ区切り) を指定します。

source: Specify the relevant xref:categories[Categories] (comma separated).
ja_jp: 該当する <<カテゴリー>> を指定してください（カンマ区切り）。

source: Specify whether or not this logger should send its output to its parent logger.
ja_jp: このロガーがその出力を親ロガーに送信するかどうかを指定します。

source: Specify whether this logger should send its output to its parent logger.
ja_jp: このロガーがその出力を親ロガーに送信するかどうかを指定します。

source: Specifying the Quarkus version
ja_jp: Quarkus バージョンの指定

source: Specifying the registry URL on the command line is not very convenient, so you can add a configuration property only for the `prod` profile:
ja_jp: コマンドラインでレジストリー URL を指定する方法は便利ではないため、`prod` プロファイルに対してのみ設定プロパティーを追加します。

source: Split the custom cookie value into 2 parts, first part is the encrypted token, last part is the tenant id.
ja_jp: カスタム Cookie 値を 2 つの部分に分割します。最初の部分は暗号化されたトークン、最後の部分はテナント ID です。
